Revit 2024 API
FailuresAccessor.GetDocument Method
 Provides access to a document for which failures are being processed or preprocessed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Document GetDocument()
Visual Basic
Public Function GetDocument As Document
Visual C++
public:
Document^ GetDocument()
Return Value
 The document for which failures preprocessing or processing is being performed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace